// Модуль объекта: Catalog.Характеристики

// Заполнение наименования ДО валидации обязательных полей
Процедура ОбработкаЗаполнения(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Значения = Новый Массив;
	Для Каждого СтрокаСвойств из Свойства Цикл
		Если ЗначениеЗаполнено(СтрокаСвойств.Значение) Тогда
			Значения.Добавить(СтрокаСвойств.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если Значения.Количество() > 0 Тогда
		Наименование = СтрСоединить(Значения, ", ");
	Иначе
		Наименование = "Характеристика";
	КонецЕсли;

КонецПроцедуры
