// Модуль формы: Document.РасходТоваров.Form.ФормаДокумента

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	// Заполняем артикул из выбранной номенклатуры
	Если Объект.Товары[Объект.Товары.ТекущиеДанные].Номенклатура <> Неопределено Тогда
		Объект.Товары[Объект.Товары.ТекущиеДанные].Артикул = 
			Объект.Товары[Объект.Товары.ТекущиеДанные].Номенклатура.Артикул;
	КонецЕсли;
	
КонецПроцедуры
